NECKTER/CMPE_146/projects/lpc40xx_freertos/l5_application/main.c
#include <stdio.h>
#include <stdlib.h>

#include "FreeRTOS.h"
#include "lpc40xx.h"
#include "task.h"

#include "adc.h"
#include "board_io.h"
#include "common_macros.h"
#include "gpio.h"
#include "gpio_lab.h"
#include "i2c.h"
#include "periodic_scheduler.h"
#include "pwm1.h"
#include "queue.h"
#include "semphr.h"
#include "sj2_cli.h"
#include "ssp_lab.h"
#include "uart_lab.h"

#include "gpio_isr.h"
#include "lpc_peripherals.h"

#include "acceleration.h"
#include "event_groups.h"
#include "ff.h"
#include <string.h>

static void create_blinky_tasks(void);
static void create_uart_task(void);
static void blink_task(void *params);
static void uart_task(void *params);
void led_task(void *task_parameter);
void switch_task(void *task_parameter);
void gpio_interrupt(void);
void configure_your_gpio_interrupt();
void sleep_on_sem_task(void *p);
void pin29_isr(void); // Lab 3
void pin30_isr(void);
void pwm_task(void *p); // Lab 4
void adc_task(void *p);

static SemaphoreHandle_t switch_press_indication;
static SemaphoreHandle_t switch_pressed_signal;
static QueueHandle_t adc_to_pwm_task_queue;

#define outOfTheBox 0
#define Lab2 0
#define Lab3 0
#define Lab4 0
#define Lab5 0
#define Lab6 0
#define Lab7 0
#define WatchDog 0
#define i2c 0
#define mp3 1

#if Lab5
static SemaphoreHandle_t spi_bus_mutex;
typedef struct {
  uint8_t manufacturer_id;
  uint8_t device_id_1;
  uint8_t device_id_2;
  uint8_t extended_device_id;
} adesto_flash_id_s;
gpio_s chipSelect;
gpio_s dummySelect;
void task_one();
void task_two();
void adesto_cs(void) { // LPC_GPIO1->CLR |= (1 << 10);
  gpio__reset(chipSelect);
  gpio__reset(dummySelect);
}
void adesto_ds(void) { // LPC_GPIO1->SET |= (1 << 10);
  gpio__set(chipSelect);
  gpio__set(dummySelect);
}
void spi_task(void *p);
#endif

#if Lab6
void uart_read_task(void *p);
void uart_write_task(void *p);
void board_1_sender_task(void *p);
void board_2_receiver_task(void *p);
#endif

#if Lab7
static QueueHandle_t switch_queue;

typedef enum { switch__off, switch__on } switch_e;

void producer(void *p);
void consumer(void *p);
#endif

#if WatchDog
static QueueHandle_t watchdog_queue;
static EventGroupHandle_t xCreateGroup;
void watchdog_main();
#endif

#if i2c
/*
   // pp. 636, 648 i2C
#define i2c1 1
#if i2c1
  LPC_IOCON->P0_0 &= ~0x41f;      // i2c_1
  LPC_IOCON->P0_1 &= ~0x41f;      // i2c_1
  LPC_IOCON->P0_0 |= 0x3;         // i2c_1
  LPC_IOCON->P0_0 |= (0x0 << 3);  // i2c_1
  LPC_IOCON->P0_0 |= (0x1 << 10); // i2c_1
  LPC_IOCON->P0_1 |= 0x3;         // i2c_1
  LPC_IOCON->P0_1 |= (0x3 << 3);  // i2c_1
  LPC_IOCON->P0_1 |= (0x1 << 10); // i2c_1
  i2c__initialize_slave(I2C__1);
#else
  LPC_IOCON->P1_30 &= ~0x7; // i2c_1
  LPC_IOCON->P1_31 &= ~0x7; // i2c_1
  LPC_IOCON->P1_30 |= 0x4;  // i2c_1
  LPC_IOCON->P1_31 |= 0x4;  // i2c_1
  i2c__initialize_slave(I2C__0);
#endif

  puts("I2c_1 Slave init");
  i2c__write_single(I2C__2, 0x70, 0, 0x77);
  uint8_t read = i2c__read_single(I2C__2, 0x70, 0);
  printf("Read: 0x%02X from 0x70\n", read);
  printf("Checking address: 0x%02X\n", 112);
  if (i2c__detect(I2C__2, 112)) {
    printf("I2C slave detected at address: 0x%02X\n", 112);
  }
 * */
static volatile uint8_t slave_memory[256];
bool i2c_slave_callback__read_memory(uint8_t memory_index, uint8_t *memory) {
  // TODO: Read the data from slave_memory[memory_index] to *memory pointer
  // TODO: return true if all is well (memory index is within bounds)
  bool status = true;
  // LPC_I2C2->ADRO0 |= memory_index;
  *memory = slave_memory[memory_index];
  if (LPC_I2C2->STAT == 0x78 || LPC_I2C2->STAT == 0xB0) {
    status = false;
  }
  return status;
}

bool i2c_slave_callback__write_memory(uint8_t memory_index, uint8_t memory_value) {
  // TODO: Write the memory_value at slave_memory[memory_index]
  // TODO: return true if memory_index is within bounds
  bool status = true;
  slave_memory[memory_index] = memory_value;
  if (LPC_I2C2->STAT == 0x78 || LPC_I2C2->STAT == 0xB0) {
    status = false;
  }
  return status;
}
#endif

#if mp3
#include "LCD_driver.h"
#include "audio_driver.h"
#include "i2c_slave_init.h"
#include "uart_lab.h"

extern QueueHandle_t song_name_queue;
static QueueHandle_t mp3_file_queue;
static SemaphoreHandle_t signal_playPause;
static SemaphoreHandle_t signal_menu;
const int NUM_OF_SONGS = 2;
typedef char songname_t[32];
typedef char song_data_t[512];
bool pause_music_interrupt = false;

char song_array[2][32];
int song_count = 0;
bool new_song_interrupt = false;
uint16_t adc_value;
uint8_t volume = 0x7E;

static volatile int menu = 0;
const int number_of_menues = 5;

gpio_s Led0;
gpio_s Led1;
gpio_s Led2;
gpio_s Led3;

static void read_file(const char *filename) {
  puts("Read and stored file name");
  FIL file;
  UINT bytes_written = 0;
  new_song_interrupt = false;
  FRESULT result = f_open(&file, filename, (FA_READ | FA_OPEN_EXISTING));
  if (FR_OK == result) {
    song_data_t buffer = {};
    UINT bytes_to_read = 512;
    UINT bytes_done_reading = 1;
    while (bytes_done_reading > 0) {
      if (new_song_interrupt) {
        break;
      }
      if (!pause_music_interrupt) {
        FRESULT rd = f_read(&file, buffer, bytes_to_read, &bytes_done_reading);
        xQueueSend(mp3_file_queue, buffer, portMAX_DELAY);
      } else {
        bytes_done_reading = 1;
      }
      // FRESULT rd = f_read(&file, buffer, bytes_to_read, &bytes_done_reading);
      // xQueueSend(mp3_file_queue, buffer, portMAX_DELAY);

      // if (FR_OK == rd) {
      //   printf("%d bytes\n", bytes_done_reading);
      // }
    }
    f_close(&file); // not sure when to close file
  } else {
    puts("Unavailable song");
  }
}
static void mp3_file_reader_task(void *p) {
  songname_t s_name = {};
  while (1) {
    if (xQueueReceive(song_name_queue, &s_name, 3000)) {
      read_file(s_name);
    } else {
      puts("Queue did not receive item");
    }
  }
}
static void mp3_decoder_send_block(song_data_t s_data) {
  for (size_t index = 0; index < sizeof(song_data_t); index++) {
    vTaskDelay(3);
    putchar(s_data[index]);
  }
}
static void print_hex(song_data_t s_data) {
  for (size_t index = 0; index < sizeof(song_data_t); index++) {
    vTaskDelay(1);
    printf("%02x", s_data[index]);
  }
}
static void mp3_data_player_task(void *p) {
  song_data_t s_data = {};
  while (1) {
    memset(&s_data[0], 0, sizeof(song_data_t));
    if (xQueueReceive(mp3_file_queue, &s_data[0], portMAX_DELAY)) {
      // mp3_decoder_send_block(s_data);
      //      print_hex(s_data);
      play_data(&s_data, 512);
    }
  }
}

static void set_LEDs(int ld0, int ld1, int ld2, int ld3) {
  ld0 ? gpio__reset(Led0) : gpio__set(Led0);
  ld1 ? gpio__reset(Led1) : gpio__set(Led1);
  ld2 ? gpio__reset(Led2) : gpio__set(Led2);
  ld3 ? gpio__reset(Led3) : gpio__set(Led3);
}

static void select_menu() {
  while (1) {
    if (xSemaphoreTake(signal_menu, portMAX_DELAY)) {
      menu = (menu + 1) % number_of_menues;
      switch (menu) {
      case 0:
        set_LEDs(0, 0, 0, 0);
        break;
      case 1:
        set_LEDs(0, 0, 0, 1);
        break;
      case 2:
        set_LEDs(0, 0, 1, 0);
        break;
      case 3:
        set_LEDs(0, 0, 1, 1);
        break;
      case 4:
        set_LEDs(0, 1, 0, 0);
        break;
      case 5:
        set_LEDs(0, 1, 0, 1);
        break;
      case 6:
        set_LEDs(0, 1, 1, 0);
        break;
      case 7:
        set_LEDs(0, 1, 1, 1);
        break;
      case 8:
        set_LEDs(1, 0, 0, 0);
        break;
      case 9:
        set_LEDs(1, 0, 0, 1);
        break;
      case 10:
        set_LEDs(1, 0, 1, 0);
        break;
      case 11:
        set_LEDs(1, 0, 1, 1);
        break;
      case 12:
        set_LEDs(1, 1, 0, 0);
        break;
      case 13:
        set_LEDs(1, 1, 0, 1);
        break;
      case 14:
        set_LEDs(1, 1, 1, 0);
        break;
      case 15:
        set_LEDs(1, 1, 1, 1);
        break;
      default:
        break;
      }
    }
  }
}

static void scan_Buttons() {
  bool right_button = 0;
  bool left_button = 0;
  gpio_s RB = gpio__construct_as_input(GPIO__PORT_1, 19); // Right
  gpio_s LB = gpio__construct_as_input(GPIO__PORT_1, 15); // Left
  while (1) {
    right_button = gpio__get(RB);
    left_button = gpio__get(LB);
    if (right_button) {
      switch (menu) {
      case 0: // Next song
              //        puts("next Song");
        new_song_interrupt = true;
        song_count++;
        if (song_count >= NUM_OF_SONGS) {
          song_count = 0;
        }
        xQueueSendFromISR(song_name_queue, song_array[song_count], NULL);
        break;
      case 1: // volume up
        if (volume > 0x00) {
          volume = volume - 0x1;
          set_volume(volume, volume);
        }
        break;
      case 2: // bass
        break;
      case 3: // treble
        break;
      case 4: // scroll
        break;
      default: // trebble and bass

        break;
      }
    }
    if (left_button) {
      switch (menu) {
      case 0: // previous song
              //        puts("previous Song");
        new_song_interrupt = true;
        song_count--;
        if (song_count < 0) {
          song_count = NUM_OF_SONGS - 1;
        }
        xQueueSendFromISR(song_name_queue, song_array[song_count], NULL);
        break;
      case 1: // volume down
        if (volume < 0xFE) {
          volume = volume + 0x1;
          set_volume(volume, volume);
        }
        break;
      case 2: // bass
        break;
      case 3: // treble
        break;
      case 4: // scroll
        break;
      default:

        break;
      }
    }
    vTaskDelay(150);
  }
}

