NECKTER/CMPE_146/projects/lpc40xx_freertos/l5_application/main.c
static void play_pause() {
  while (1) {
    if (xSemaphoreTake(signal_playPause, portMAX_DELAY)) {
      new_song_interrupt = new_song_interrupt ? false : true;
      //      puts("play/pause");
    }
  }
}

static void signal_PlayPauseISR() { xSemaphoreGiveFromISR(signal_playPause, 0); }
static void signal_menuISR() { xSemaphoreGiveFromISR(signal_menu, 0); }

static void button_init() {
  signal_playPause = xSemaphoreCreateBinary();
  signal_menu = xSemaphoreCreateBinary();
  gpio0__attach_interrupt(29, GPIO_INTR__RISING_EDGE, signal_PlayPauseISR); // Play pause
  gpio0__attach_interrupt(30, GPIO_INTR__RISING_EDGE, signal_menuISR);      // menu select

  Led0 = gpio__construct_as_output(1, 18);
  Led1 = gpio__construct_as_output(1, 24);
  Led2 = gpio__construct_as_output(1, 26);
  Led3 = gpio__construct_as_output(2, 3);
  set_LEDs(0, 0, 0, 0);

  // scan function
  xTaskCreate(scan_Buttons, "scan_Buttons", 4096, NULL, 2, NULL);
  xTaskCreate(play_pause, "play_pause", 4096, NULL, 3, NULL);
  xTaskCreate(select_menu, "select_menu", 4096, NULL, 3, NULL);
  NVIC_EnableIRQ(GPIO_IRQn); // Enable interrupt gate for the GPIO
}

TaskHandle_t read_handle;
TaskHandle_t play_handle;
void milestone_1_main() {
  song_name_queue = xQueueCreate(1, sizeof(songname_t));
  mp3_file_queue = xQueueCreate(2, sizeof(song_data_t));

  xTaskCreate(mp3_file_reader_task, "reader", 512, NULL, 2, &read_handle);
  xTaskCreate(mp3_data_player_task, "player", 512, NULL, 1, &play_handle);
  // xTaskCreate(get_song_name_task, "Get Song Name", 1, NULL, PRIORITY_MEDIUM, &get_name);
}

// #include "LCD_display.h"
#include "adc.h"
#include "gpio.h"
#include "gpio_isr.h"
#include "ssp2.h"

void spi_task(void *p) {
  reset();
  ssp2__initialize(24);
  // gpio__set(xdcs_pin);
  while (1) {
    // write_decoder();
    sci_write(0x0B, 0x050E);
    uint16_t p = sci_read(0x0B);
    // uint8_t p = 5;
    vTaskDelay(100);
    fprintf(stderr, "Version: %04x\n", p);
  }
}
void milestone_2_main() {
  gpio__construct_with_function(GPIO__PORT_1, 4, GPIO__FUNCTION_4); // mosi
  gpio__construct_with_function(GPIO__PORT_1, 1, GPIO__FUNCTION_4); // miso
  gpio__construct_with_function(GPIO__PORT_1, 0, GPIO__FUNCTION_4); // sck
  // reset();
  ssp2__initialize(24);
  sine_test(2, 3000);
  begin();
  // xTaskCreate(spi_task, "task1", (512U * 4) / sizeof(void *), NULL, 1, NULL);
}

// void adc_task(void *p) {
//  adc__initialize();
//  adc__enable_burst_mode(ADC__CHANNEL_5);
//  LPC_IOCON->P1_31 &= ~(1 << 7);
//  adc_value = 10;
//  int currVal = 0;
//  while (1) {
//    adc_value = adc__get_channel_reading_with_burst_mode();
//    // fprintf(stderr, "res:%d", adc_value);
//    if (adc_value - currVal > 50 || adc_value - currVal < -50) {
//      currVal = adc_value;
//      if (adc_value < 500) {
//        set_volume(0x00, 0x00);
//      } else if (adc_value < 1000) {
//        set_volume(0x0F, 0x0F);
//      } else if (adc_value < 1500) {
//        set_volume(0x30, 0x30);
//      } else if (adc_value < 2000) {
//        set_volume(0x4F, 0x4F);
//      } else if (adc_value < 2500) {
//        set_volume(0x5F, 0x5F);
//      } else if (adc_value < 3000) {
//        set_volume(0x6F, 0x6F);
//      } else if (adc_value < 3500) {
//        set_volume(0xBF, 0xBF);
//      } else {
//        set_volume(0xFE, 0xFE);
//      }
//    }
//
//    vTaskDelay(2000);
//  }
//}

// void adc_setup() { xTaskCreate(adc_task, "adc_task", (512U * 4) / sizeof(void *), NULL, 3, NULL); }

#endif

int main(void) { // main function for project
  puts("Starting RTOS");
  create_uart_task();
#if outOfTheBox
  create_blinky_tasks();
#else
  //  milestone_1_main();
  button_init();
  pin_config();
  milestone_2_main();
  milestone_1_main();
  //  adc_setup();

  puts("Main done");
#endif
  vTaskStartScheduler(); // This function never returns unless RTOS scheduler runs out of memory and fails
  return 0;
}

#if WatchDog
/*WatchDog Group Lab*/

void write_file_using_fatfs_pi(acceleration__axis_data_s receive_value) {
  const char *filename = "WatchDog_Data.csv";
  FIL file; // File handle
  UINT bytes_written = 0;

  // Open for the first time
  FRESULT result = f_open(&file, filename, (FA_WRITE | FA_CREATE_NEW));
  if (FR_OK == result) {
    char string[64] = "";
    // sprintf(string, "Value,%i\n", 123);
    sprintf(string, "x,y,z\n");
    if (FR_OK == f_write(&file, string, strlen(string), &bytes_written)) {
    } else {
      printf("ERROR: Failed to write data to file\n");
    }
    sprintf(string, "%d,%d,%d\n", receive_value.x, receive_value.y, receive_value.z);
    if (FR_OK == f_write(&file, string, strlen(string), &bytes_written)) {
    } else {
      printf("ERROR: Failed to write data to file\n");
    }
    f_close(&file);

  } else {
    result = f_open(&file, filename, (FA_WRITE | FA_OPEN_APPEND));
    if (FR_OK == result) {
      char string[64];
      // sprintf(string, "Value,%i\n", 123);
      sprintf(string, "%d,%d,%d\n", receive_value.x, receive_value.y, receive_value.z);
      // fprintf(stderr, "printed\n");
      if (FR_OK == f_write(&file, string, strlen(string), &bytes_written)) {
      } else {
        printf("ERROR: Failed to write data to file\n");
      }
      f_close(&file);

    } else {
      printf("ERROR %d: Failed to open: %s\n", result, filename);
    }
  }
}

acceleration__axis_data_s get_send_value() {
  acceleration__axis_data_s avg;
  int xVal = 0;
  int yVal = 0;
  int zVal = 0;
  for (int i = 0; i < 100; i++) {
    xVal += acceleration__get_data().x;
    yVal += acceleration__get_data().y;
    zVal += acceleration__get_data().z;
    delay__ms(1);
  }
  avg.x = xVal / 100;
  avg.y = yVal / 100;
  avg.z = zVal / 100;
  return avg;
}

void producer_of_sensor(void *p) {
  // fprintf(stderr, "producer\n");
  while (1) {
    acceleration__axis_data_s send_value = get_send_value();
    xQueueSend(watchdog_queue, &send_value, 0);
    xEventGroupSetBits(xCreateGroup, (1 << 1));
    vTaskDelay(1000);
  }
}

// TODO: Create this task at PRIORITY_HIGH
void consumer_of_sensor(void *p) {
  acceleration__axis_data_s receive_value;
  while (1) {
    // TODO: Print a message before xQueueReceive()
    // fprintf(stderr, "before xqueuereceive\n");
    if (xQueueReceive(watchdog_queue, &receive_value, portMAX_DELAY)) {
      //      fprintf(stderr, "x: %d, y: %d, z: %d\n", receive_value.x, receive_value.y, receive_value.z);
      write_file_using_fatfs_pi(receive_value);
    }
    xEventGroupSetBits(xCreateGroup, (1 << 2));
  }
}

void watchdog_task(void *params) {
  while (1) {
    vTaskDelay(1000);
    EventBits_t check = xEventGroupWaitBits(xCreateGroup, (1 << 1) | (1 << 2), pdTRUE, pdFALSE, 200);
    if (((check & (1 << 1)) != 0) && ((check & (1 << 2)) != 0)) {
      // Was able to complete both tasks. Be Humble
      //      fprintf(stderr, "Successfully completed both tasks\n");
    } else {
      // fprintf(stderr, "Producer task unfinished\n");
      if (check & (1 << 1)) {
        fprintf(stderr, "Consumer task unfinished\n");
      } else if (check & (1 << 2)) {
        fprintf(stderr, "Producer task unfinished\n");
      } else {
        fprintf(stderr, "Both tasks didnt finish\n");
      }
    }
  }
}
void watchdog_main() {
  if (acceleration__init()) {
    fprintf(stderr, "Acceleration Initialized\n");
  }
  TaskHandle_t prod_watchdog;
  TaskHandle_t cons_watchdog;
  TaskHandle_t watchdog;
  xTaskCreate(producer_of_sensor, "producer", 1024, NULL, 2, &prod_watchdog);
  xTaskCreate(consumer_of_sensor, "consumer", 1024, NULL, 2, &cons_watchdog);
  xTaskCreate(watchdog_task, "watchdog", 1024, NULL, 3, &watchdog);
  // TODO Queue handle is not valid until you create it
  watchdog_queue = xQueueCreate(
      1, sizeof(acceleration__axis_data_s)); // Choose depth of item being our enum (1 should be okay for this example
  xCreateGroup = xEventGroupCreate();
}
#endif

#if Lab7
/*

  xTaskCreate(producer, /*description*/ "producer", /*stack depth*/ 4096 / sizeof(void *),
/*parameter*/ (void *)1,
/*priority*/ 1, /*optional handle*/ NULL);
xTaskCreate(consumer, /*description*/ "consumer", /*stack depth*/ 4096 / sizeof(void *),
            /*parameter*/ (void *)1,
            /*priority*/ 2, /*optional handle*/ NULL);

