NECKTER/CMPE_146/projects/lpc40xx_freertos/l5_application/main.c
// TODO Queue handle is not valid until you create it
switch_queue =
    xQueueCreate(1, sizeof(switch_e)); // Choose depth of item being our enum (1 should be okay for this example)

** /
    // TODO: Create this task at PRIORITY_LOW
    void producer(void *p) {
  //  // SW3 p0.29
  LPC_IOCON->P0_29 &= ~(0x3 << 3);
  LPC_IOCON->P0_29 |= (1 << 3); // pull down
  LPC_GPIO0->DIR &= ~(1 << 29); // set as input

  while (1) {
    // This xQueueSend() will internally switch context to "consumer" task because it is higher priority than this
    // "producer" task Then, when the consumer task sleeps, we will resume out of xQueueSend()and go over to the next
    // line

    // TODO: Get some input value from your board
    const switch_e switch_value = (LPC_GPIO0->PIN & (1 << 29)) >> 29; // value of switch

    // TODO: Print a message before xQueueSend()
    // Note: Use printf() and not fprintf(stderr, ...) because stderr is a polling printf
    printf("sending switch_value: %d\n", switch_value);
    xQueueSend(switch_queue, &switch_value, 0);
    // TODO: Print a message after xQueueSend()
    printf("Returned to producer task\n");

    vTaskDelay(1000);
  }
}

// TODO: Create this task at PRIORITY_HIGH
void consumer(void *p) {
  switch_e switch_value;
  while (1) {
    // TODO: Print a message before xQueueReceive()
    printf("waiting to consume a value from the queue\n");
    xQueueReceive(switch_queue, &switch_value, portMAX_DELAY);
    // TODO: Print a message after xQueueReceive()
    printf("received switch_value: %d\n", switch_value);
  }
}
#endif

#if Lab6
/*
   // TODO: Use uart_lab__init() function and initialize UART2 or UART3 (your choice)
  // TODO: Pin Configure IO pins to perform UART2/UART3 function
  uart_lab__init(UART_2, 96, 115200);
  uart__enable_receive_interrupt(UART_2);
  uart_lab__init(UART_3, 96, 115200);
  uart__enable_receive_interrupt(UART_3);
   xTaskCreate(producer, /*description*/ "uart_task", /*stack depth*/ 4096 / sizeof(void *),
              /*parameter*/ (void *)1,
              /*priority*/ 1, /*optional handle*/ NULL);
xTaskCreate(consumer, /*description*/ "uart_task2", /*stack depth*/ 4096 / sizeof(void *),
            /*parameter*/ (void *)1,
            /*priority*/ 2, /*optional handle*/ NULL);
** / void uart_read_task(void *p) {
  while (1) {
    // TODO: Use uart_lab__polled_get() function and printf the received value
    char testValue = 0;
    uart_lab__polled_get(UART_2, &testValue);
    fprintf(stderr, "%c", testValue);
    vTaskDelay(500);
  }
}

void uart_write_task(void *p) {
  char testString[] = "Hello world\n\n";
  int strlength = sizeof(testString) / sizeof(char);
  int i = 0;
  fprintf(stderr, "%s", testString);
  while (1) {
    // TODO: Use uart_lab__polled_put() function and send a value
    uart_lab__polled_put(UART_3, testString[i % strlength]);
    ++i;
    vTaskDelay(500);
  }
}
// This task is done for you, but you should understand what this code is doing
void board_1_sender_task(void *p) {
  char number_as_string[] = "Hello World";

  while (true) {
    //        const int number = rand();
    //        sprintf(number_as_string, "%i", number);

    // Send one char at a time to the other board including terminating NULL char
    for (int i = 0; i <= strlen(number_as_string); i++) {
      uart_lab__polled_put(UART_3, number_as_string[i]);
      uart_lab__polled_put(UART_2, number_as_string[i]);
      printf("Sent: %c\n", number_as_string[i]);
    }

    //        printf("Sent: %i over UART to the other board\n", number);
    vTaskDelay(3000);
  }
}

void board_2_receiver_task(void *p) {
  char number_as_string[16] = {0};
  int counter = 0;

  while (true) {
    char byte = 0;
    uart_lab__get_char_from_queue(&byte, portMAX_DELAY);
    printf("Received: %c\n", byte);

    // This is the last char, so print the number
    if ('\0' == byte) {
      number_as_string[counter] = '\0';
      counter = 0;
      printf("Received this data from the other board: %s\n", number_as_string);
    }
    // We have not yet received the NULL '\0' char, so buffer the data
    else {
      // TODO: Store data to number_as_string[] array one char at a time
      number_as_string[counter] = byte;
      ++counter;
    }
  }
}
#endif

#if Lab5
/*
   const uint32_t spi_clock_mhz = 10;
  chipSelect = gpio__construct_as_output(GPIO__PORT_1, 10);
  dummySelect = gpio__construct_as_output(GPIO__PORT_1, 14);
  gpio__set(chipSelect);
  gpio__set(dummySelect);

  ssp2__init(spi_clock_mhz);
  spi_bus_mutex = xSemaphoreCreateMutex();
  xTaskCreate(spi_task, /*description*/ "spi_task", /*stack depth*/ 4096 / sizeof(void *), /*parameter*/ (void *)1,
/*priority*/ 1, /*optional handle*/ NULL);
xTaskCreate(spi_task, /*description*/ "spi_task2", /*stack depth*/ 4096 / sizeof(void *), /*parameter*/ (void *)1,
            /*priority*/ 1, /*optional handle*/ NULL);
* / adesto_flash_id_s adesto_read_signature(void) {
  adesto_flash_id_s data = {0};

  adesto_cs();
  {
    uint8_t opcode = ssp2__swap_byte(0x9F);
    data.manufacturer_id = ssp2__swap_byte(0xa);
    data.device_id_1 = ssp2__swap_byte(0xb);
    data.device_id_2 = ssp2__swap_byte(0xc);
    data.extended_device_id = ssp2__swap_byte(0xd);
  }
  adesto_ds();

  return data;
}

void spi_task(void *p) {

  while (1) {
    if (xSemaphoreTake(spi_bus_mutex, portMAX_DELAY)) {
      // Use Guarded Resource
      adesto_flash_id_s id = adesto_read_signature();
      fprintf(stderr,
              "manufacturer_id: %x\n"
              "device_id_1: %x\n"
              "device_id_2: %x\n"
              "extended_device_id: %x\n\n",
              id.manufacturer_id, id.device_id_1, id.device_id_2, id.extended_device_id);
      if (id.manufacturer_id != 0x1F) {
        fprintf(stderr, "Manufacturer ID read failure\n");
        vTaskSuspend(NULL); // Kill this task
      }
      // Give Semaphore back:
      xSemaphoreGive(spi_bus_mutex);
    }
  }
}
#endif

#if Lab2
void led_task(void *task_parameter) {
  gpio_pin *led = (gpio_pin *)task_parameter;
  while (true) {
    // Note: There is no vTaskDelay() here, but we use sleep mechanism while waiting for the binary semaphore (signal)
    if (xSemaphoreTake(switch_press_indication, 1000)) {
      // TODO: Blink the LED
      {
        gpio0__set_high(*led);
        vTaskDelay(100);

