NECKTER/CMPE_146/projects/lpc40xx_freertos/l5_application/main.c
        gpio0__set_low(*led);
        vTaskDelay(100);
      }
      xSemaphoreGive(switch_press_indication);
    } else {
      puts("Timeout: No switch press indication for 1000ms");
    }
    vTaskDelay(10);
  }
}

void switch_task(void *task_parameter) {
  gpio_pin *sw = (gpio_pin *)task_parameter;
  gpio0__set_as_input(*sw);

  while (true) {
    // TODO: If switch pressed, set the binary semaphore
    if (gpio0__get_level(*sw)) {
      xSemaphoreGive(switch_press_indication);
    } else
      xSemaphoreTake(switch_press_indication, 100);

    // Task should always sleep otherwise they will use 100% CPU
    // This task sleep also helps avoid spurious semaphore give during switch debeounce
    vTaskDelay(10);
  }
}
#endif

#if Lab3
// Objective of the assignment is to create a clean API to register sub-interrupts like so:
void pin29_isr(void) {
  fprintf(stderr, "Interrupt pin30\n");
  gpio_s Led = gpio__construct_as_output(1, 18);
  gpio__toggle(Led);
}
void pin30_isr(void) {
  fprintf(stderr, "Interrupt pin31\n");
  gpio_s Led = gpio__construct_as_output(1, 24);
  gpio__toggle(Led);
}
#endif

#if Lab4
/*
  adc_to_pwm_task_queue = xQueueCreate(1, sizeof(int));

  xTaskCreate(pwm_task, /*description*/ "pwm_task", /*stack depth*/ 4096 / sizeof(void *), /*parameter*/ (void *)1,
              /*priority*/ 2, /*optional handle*/ NULL);
xTaskCreate(adc_task, /*description*/ "adc_task", /*stack depth*/ 4096 / sizeof(void *), /*parameter*/ (void *)1,
            /*priority*/ 1, /*optional handle*/ NULL);
* / void pwm_task(void *p) {
  pwm1__init_single_edge(1000);

  // Locate a GPIO pin that a PWM channel will control
  // NOTE You can use gpio__construct_with_function() API from gpio.h

  gpio_s pin = gpio__construct_with_function(GPIO__PORT_2, /*Pin*/ 0, GPIO__FUNCTION_1);

  // We only need to set PWM configuration once, and the HW will drive
  // the GPIO at 1000Hz, and control set its duty cycle to 50%
  pwm1__set_duty_cycle(PWM1__2_0, 50);

  // Continue to vary the duty cycle in the loop
  uint8_t percent = 0;
  int adc_reading = 0;
  while (1) {

    if (xQueueReceive(adc_to_pwm_task_queue, &adc_reading, 100)) {
      percent = (adc_reading * 100) / 0xfff;
      pwm1__set_duty_cycle(PWM1__2_0, percent);
    }
    //    vTaskDelay(100);
  }
}

void adc_task(void *p) {
  adc__initialize();

  // TODO This is the function you need to add to adc.h
  // You can configure burst mode for just the channel you are using
  adc__enable_burst_mode();

  // Configure a pin, such as P1.31 with FUNC 011 to route this pin as ADC channel 5
  // You can use gpio__construct_with_function() API from gpio.h
  gpio_s pin = gpio__construct_with_function(GPIO__PORT_0, /*Pin*/ 25, GPIO__FUNCTION_1);
  LPC_IOCON->P0_25 &= ~(1 << 7);

  int adc_reading = 0; // Note that this 'adc_reading' is not the same variable as the one from adc_task
  while (1) {
    // Get the ADC reading using a new routine you created to read an ADC burst reading
    const uint16_t adc_value = adc__get_channel_reading_with_burst_mode(ADC__CHANNEL_2);
    float adc_voltage = (float)adc_value / 4095 * 3.3;
    fprintf(stderr, "ADC Voltage: %f\n", adc_voltage);
    // Implement code to send potentiometer value on the queue
    // a) read ADC input to 'int adc_reading'
    adc_reading = adc_value;
    // b) Send to queue: xQueueSend(adc_to_pwm_task_queue, &adc_reading, 0);
    xQueueSend(adc_to_pwm_task_queue, &adc_reading, 0);
    vTaskDelay(100);
  }
}
#endif

static void create_blinky_tasks(void) {
  /**
   * Use '#if (1)' if you wish to observe how two tasks can blink LEDs
   * Use '#if (0)' if you wish to use the 'periodic_scheduler.h' that will spawn 4 periodic tasks, one for each LED
   */
#if (1)
  // These variables should not go out of scope because the 'blink_task' will reference this memory
  static gpio_s led0, led1;

  led0 = board_io__get_led0();
  led1 = board_io__get_led1();

  xTaskCreate(blink_task, "led0", configMINIMAL_STACK_SIZE, (void *)&led0, PRIORITY_LOW, NULL);
  xTaskCreate(blink_task, "led1", configMINIMAL_STACK_SIZE, (void *)&led1, PRIORITY_LOW, NULL);
#else
  const bool run_1000hz = true;
  const size_t stack_size_bytes = 2048 / sizeof(void *); // RTOS stack size is in terms of 32-bits for ARM M4 32-bit CPU
  periodic_scheduler__initialize(stack_size_bytes, !run_1000hz); // Assuming we do not need the high rate 1000Hz task
  UNUSED(blink_task);
#endif
}

static void create_uart_task(void) {
  // It is advised to either run the uart_task, or the SJ2 command-line (CLI), but not both
  // Change '#if (0)' to '#if (1)' and vice versa to try it out
#if (0)
  // printf() takes more stack space, size this tasks' stack higher
  xTaskCreate(uart_task, "uart", (512U * 8) / sizeof(void *), NULL, PRIORITY_LOW, NULL);
#else
  sj2_cli__init();
  UNUSED(uart_task); // uart_task is un-used in if we are doing cli init()
#endif
}

static void blink_task(void *params) {
  const gpio_s led = *((gpio_s *)params); // Parameter was input while calling xTaskCreate()

  // Warning: This task starts with very minimal stack, so do not use printf() API here to avoid stack overflow
  while (true) {
    gpio__toggle(led);
    vTaskDelay(500);
  }
}

// This sends periodic messages over printf() which uses system_calls.c to send them to UART0
static void uart_task(void *params) {
  TickType_t previous_tick = 0;
  TickType_t ticks = 0;

  while (true) {
    // This loop will repeat at precise task delay, even if the logic below takes variable amount of ticks
    vTaskDelayUntil(&previous_tick, 2000);

    /* Calls to fprintf(stderr, ...) uses polled UART driver, so this entire output will be fully
     * sent out before this function returns. See system_calls.c for actual implementation.
     *
     * Use this style print for:
     *  - Interrupts because you cannot use printf() inside an ISR
     *    This is because regular printf() leads down to xQueueSend() that might block
     *    but you cannot block inside an ISR hence the system might crash
     *  - During debugging in case system crashes before all output of printf() is sent
     */
    ticks = xTaskGetTickCount();
    fprintf(stderr, "%u: This is a polled version of printf used for debugging ... finished in", (unsigned)ticks);
    fprintf(stderr, " %lu ticks\n", (xTaskGetTickCount() - ticks));

    /* This deposits data to an outgoing queue and doesn't block the CPU
     * Data will be sent later, but this function would return earlier
     */
    ticks = xTaskGetTickCount();
    printf("This is a more efficient printf ... finished in");
    printf(" %lu ticks\n\n", (xTaskGetTickCount() - ticks));
  }
}
